rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/include/Adc_MemMap.h
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7
*   Platform             : CORTEXM
*   Peripheral           : S32K14X
*   Dependencies         : none
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 3.0.0
*   Build Version        : S32K1_RTD_3_0_0_QLP04_D2509_ASR_REL_4_7_REV_0000_20250930
*
*   Copyright 2020-2025 NXP
*
*   NXP Confidential and Proprietary. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms.  By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms.  If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

/**
 *   @file Adc_MemMap.h
 *   @implements     MemMap.h_Artifact
 *   @brief   Memory mapping specification.
 *   @details This document specifies mechanisms for the mapping of code and data to specific
 *            memory sections via memory mapping file. For many ECUs and microcontroller platforms
 *            it is of utmost necessity to be able to map code, variables and constants module
 *            wise to specific memory sections.
 *            This file contains sample code only. It is not part of the production code
 * deliverables.
 *   @addtogroup BASENXP_COMPONENT
 *   @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "CompilerDefinition.h"

/*==================================================================================================
*                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
 * @{
 * @brief Parameters that shall be published within the memory map header file and also in the
 *       module's description file
 */
#define ADC_MEMMAP_VENDOR_ID 43
#define ADC_MEMMAP_AR_RELEASE_MAJOR_VERSION 4
#define ADC_MEMMAP_AR_RELEASE_MINOR_VERSION 7
#define ADC_MEMMAP_AR_RELEASE_REVISION_VERSION 0
#define ADC_MEMMAP_SW_MAJOR_VERSION 3
#define ADC_MEMMAP_SW_MINOR_VERSION 0
#define ADC_MEMMAP_SW_PATCH_VERSION 0
/**@}*/
/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/

/*==================================================================================================
                                           CONSTANTS
==================================================================================================*/

/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/

/**
 * @brief Symbol used for checking correctness of the includes
 */
#define MEMMAP_ERROR

/**************************************************************************************************/
/********************************************* GREENHILLS *****************************************/
/**************************************************************************************************/
#ifdef _GREENHILLS_C_S32K1XX_
/**************************************** ADC *******************************/
#ifdef ADC_START_SEC_CONFIG_DATA_8
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONFIG_DATA_8
#define ENTERED_ADC_START_SEC_CONFIG_DATA_8
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONFIG_DATA_8
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section rodata = ".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_8
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_8
#undef ENTERED_ADC_START_SEC_CONFIG_DATA_8
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONFIG_DATA_8
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_16
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONFIG_DATA_16
#define ENTERED_ADC_START_SEC_CONFIG_DATA_16
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONFIG_DATA_16
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section rodata = ".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_16
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_16
#undef ENTERED_ADC_START_SEC_CONFIG_DATA_16
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONFIG_DATA_16
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_32
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONFIG_DATA_32
#define ENTERED_ADC_START_SEC_CONFIG_DATA_32
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONFIG_DATA_32
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section rodata = ".mcal_const_cfg"
#endif

