rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/include/Adc_MemMap.h
#ifdef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section bss = ".ae_shared_bss" data = ".ae_shared_data"
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED_AE_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif

#ifdef ADC_START_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section bss = ".ae_shared_bss" data = ".ae_shared_data"
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_AE_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif

#ifdef ADC_START_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section data = ".mcal_shared_data" bss = ".mcal_shared_bss"
#endif

#ifdef ADC_STOP_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_SHARED_INIT_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif

#ifdef ADC_START_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section bss = ".mcal_shared_bss"
#endif

#ifdef ADC_STOP_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_SHARED_CLEARED_UNSPECIFIED_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma ghs section
#endif
/**************************************************************************************************/
/********************************************* DIAB ***********************************************/
/**************************************************************************************************/
#elif defined(_DIABDATA_C_S32K1XX_)
/**************************************** ADC *******************************/
#ifdef ADC_START_SEC_CONFIG_DATA_8
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONFIG_DATA_8
#define ENTERED_ADC_START_SEC_CONFIG_DATA_8
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONFIG_DATA_8
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const_cfg"
#else
#pragma section CONST ".mcal_const_cfg"
#endif
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_8
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_8
#undef ENTERED_ADC_START_SEC_CONFIG_DATA_8
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONFIG_DATA_8
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_16
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONFIG_DATA_16
#define ENTERED_ADC_START_SEC_CONFIG_DATA_16
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONFIG_DATA_16
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const_cfg"
#else
#pragma section CONST ".mcal_const_cfg"
#endif
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_16
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_16
#undef ENTERED_ADC_START_SEC_CONFIG_DATA_16
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONFIG_DATA_16
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

