rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/include/Adc_MemMap.h
#ifdef ADC_START_SEC_CONST_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_BOOLEAN
#define ENTERED_ADC_START_SEC_CONST_BOOLEAN
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_BOOLEAN
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const"
#else
#pragma section CONST ".mcal_const"
#endif
#endif

#ifdef ADC_STOP_SEC_CONST_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_BOOLEAN
#undef ENTERED_ADC_START_SEC_CONST_BOOLEAN
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

#ifdef ADC_START_SEC_CONST_8
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_8
#define ENTERED_ADC_START_SEC_CONST_8
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_8
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const"
#else
#pragma section CONST ".mcal_const"
#endif
#endif

#ifdef ADC_STOP_SEC_CONST_8
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_8
#undef ENTERED_ADC_START_SEC_CONST_8
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_8
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

#ifdef ADC_START_SEC_CONST_16
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_16
#define ENTERED_ADC_START_SEC_CONST_16
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_16
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const"
#else
#pragma section CONST ".mcal_const"
#endif
#endif

#ifdef ADC_STOP_SEC_CONST_16
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_16
#undef ENTERED_ADC_START_SEC_CONST_16
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_16
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

#ifdef ADC_START_SEC_CONST_32
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_32
#define ENTERED_ADC_START_SEC_CONST_32
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_32
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const"
#else
#pragma section CONST ".mcal_const"
#endif
#endif

#ifdef ADC_STOP_SEC_CONST_32
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_32
#undef ENTERED_ADC_START_SEC_CONST_32
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_32
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

#ifdef ADC_START_SEC_CONST_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_UNSPECIFIED
#define ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_UNSPECIFIED
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ".mcal_const"
#else
#pragma section CONST ".mcal_const"
#endif
#endif

#ifdef ADC_STOP_SEC_CONST_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
#undef ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section CONST
#endif
#endif

#ifdef ADC_START_SEC_CODE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CODE
#define ENTERED_ADC_START_SEC_CODE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CODE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = "" text = ".mcal_text"
#else
/* no definition -> default compiler settings are used */
#endif
#endif

#ifdef ADC_STOP_SEC_CODE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CODE
#undef ENTERED_ADC_START_SEC_CODE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CODE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = "" text = ""
#else
/* no definition -> default compiler settings are used */
#endif
#endif

#ifdef ADC_START_SEC_RAMCODE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_RAMCODE
#define ENTERED_ADC_START_SEC_RAMCODE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_RAMCODE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = "" text = ".ramcode"
#else
#pragma section CODE ".ramcode" far - absolute
#endif
#endif

#ifdef ADC_STOP_SEC_RAMCODE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_RAMCODE
#undef ENTERED_ADC_START_SEC_RAMCODE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_RAMCODE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
/* default section for CODE */
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = "" text = ""
#else
#pragma section CODE
#endif
#endif

