rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/include/Adc_MemMap.h
#ifdef ADC_START_SEC_VAR_INIT_8
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_INIT_8
#define ENTERED_ADC_START_SEC_VAR_INIT_8
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_INIT_8
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss" data = ".mcal_data" rodata = ""
#else
#pragma section DATA ".mcal_data"                                                                  \
                     ".mcal_bss"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_8
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_INIT_8
#undef ENTERED_ADC_START_SEC_VAR_INIT_8
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_INIT_8
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

#ifdef ADC_START_SEC_VAR_INIT_16
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_INIT_16
#define ENTERED_ADC_START_SEC_VAR_INIT_16
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_INIT_16
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss" data = ".mcal_data" rodata = ""
#else
#pragma section DATA ".mcal_data"                                                                  \
                     ".mcal_bss"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_16
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_INIT_16
#undef ENTERED_ADC_START_SEC_VAR_INIT_16
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_INIT_16
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

#ifdef ADC_START_SEC_VAR_INIT_32
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_INIT_32
#define ENTERED_ADC_START_SEC_VAR_INIT_32
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_INIT_32
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss" data = ".mcal_data" rodata = ""
#else
#pragma section DATA ".mcal_data"                                                                  \
                     ".mcal_bss"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_32
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_INIT_32
#undef ENTERED_ADC_START_SEC_VAR_INIT_32
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_INIT_32
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

#ifdef ADC_START_SEC_VAR_INIT_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_INIT_UNSPECIFIED
#define ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss" data = ".mcal_data" rodata = ""
#else
#pragma section DATA ".mcal_data"                                                                  \
                     ".mcal_bss"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED
#undef ENTERED_ADC_START_SEC_VAR_INIT_UNSPECIFIED
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss_no_cacheable" data = ".mcal_data_no_cacheable" rodata = ""
#else
#pragma section DATA ".mcal_data_no_cacheable"                                                     \
                     ".mcal_bss_no_cacheable"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_8_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_CLEARED_8_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_CLEARED_8_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_CLEARED_8_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss_no_cacheable" data = ".mcal_data_no_cacheable" rodata = ""
#else
#pragma section DATA ".mcal_data_no_cacheable"                                                     \
                     ".mcal_bss_no_cacheable"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_8_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_8_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_CLEARED_8_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_CLEARED_8_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_16_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_CLEARED_16_NO_CACHEABLE
#define ENTERED_ADC_START_SEC_VAR_CLEARED_16_NO_CACHEABLE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_CLEARED_16_NO_CACHEABLE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = ".mcal_bss_no_cacheable" data = ".mcal_data_no_cacheable" rodata = ""
#else
#pragma section DATA ".mcal_data_no_cacheable"                                                     \
                     ".mcal_bss_no_cacheable"
#endif
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_16_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_16_NO_CACHEABLE
#undef ENTERED_ADC_START_SEC_VAR_CLEARED_16_NO_CACHEABLE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_CLEARED_16_NO_CACHEABLE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#ifdef __clang__
#pragma clang section bss = "" data = "" rodata = ""
#else
#pragma section DATA
#endif
#endif

