rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/include/Adc_MemMap.h
#ifdef ADC_START_SEC_CONST_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_BOOLEAN
#define ENTERED_ADC_START_SEC_CONST_BOOLEAN
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_BOOLEAN
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_BOOLEAN
#undef ENTERED_ADC_START_SEC_CONST_BOOLEAN
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_8
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_8
#define ENTERED_ADC_START_SEC_CONST_8
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_8
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_8
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_8
#undef ENTERED_ADC_START_SEC_CONST_8
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_8
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_16
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_16
#define ENTERED_ADC_START_SEC_CONST_16
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_16
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_16
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_16
#undef ENTERED_ADC_START_SEC_CONST_16
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_16
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_32
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_32
#define ENTERED_ADC_START_SEC_CONST_32
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_32
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_32
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_32
#undef ENTERED_ADC_START_SEC_CONST_32
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_32
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CONST_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CONST_UNSPECIFIED
#define ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CONST_UNSPECIFIED
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG mcal_const
#endif

#ifdef ADC_STOP_SEC_CONST_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
#undef ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CONST_UNSPECIFIED
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CONST_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CODE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CODE
#define ENTERED_ADC_START_SEC_CODE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CODE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CODE_SEG mcal_text
#endif

#ifdef ADC_STOP_SEC_CODE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CODE
#undef ENTERED_ADC_START_SEC_CODE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CODE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CODE_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_RAMCODE
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_RAMCODE
#define ENTERED_ADC_START_SEC_RAMCODE
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_RAMCODE
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CODE_SEG ramcode
#endif

#ifdef ADC_STOP_SEC_RAMCODE
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_RAMCODE
#undef ENTERED_ADC_START_SEC_RAMCODE
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_RAMCODE
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CODE_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_CODE_AC
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_CODE_AC
#define ENTERED_ADC_START_SEC_CODE_AC
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_CODE_AC
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CODE_SEG acadc_code_rom
#endif

#ifdef ADC_STOP_SEC_CODE_AC
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_CODE_AC
#undef ENTERED_ADC_START_SEC_CODE_AC
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_CODE_AC
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma CODE_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_CLEARED_BOOLEAN
#define ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma DATA_SEG mcal_bss
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN
#undef ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma DATA_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_8
/**
 * @file Adc_MemMap.h
 */
#undef ADC_START_SEC_VAR_CLEARED_8
#define ENTERED_ADC_START_SEC_VAR_CLEARED_8
#ifndef MEMMAP_MATCH_ERROR
#define MEMMAP_MATCH_ERROR
#else
#ifndef ADC_STOP_SEC_VAR_CLEARED_8
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#endif
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma DATA_SEG mcal_bss
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_8
/**
 * @file Adc_MemMap.h
 */
#ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_8
#undef ENTERED_ADC_START_SEC_VAR_CLEARED_8
#else
#error "MemMap.h, no valid matching start-stop section defined."
#endif
#ifdef MEMMAP_MATCH_ERROR
#undef MEMMAP_MATCH_ERROR
#endif
#undef ADC_STOP_SEC_VAR_CLEARED_8
/**
 * @file Adc_MemMap.h
 */
#undef MEMMAP_ERROR
#pragma DATA_SEG DEFAULT
#endif

